<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of WorkFlowy.</string>
	<key>Identifier</key>
	<string>com.github.dustinjlandgraf.download.WorkFlowy</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WorkFlowy</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://objects.githubusercontent.com/github-production-release-asset-2e65be/59527202/63d7b536-e43f-4bfa-9f1b-26a32886c8c9?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20220301%2Fus-east-1%2Fs3%2Faws4_request&amp;X-Amz-Date=20220301T154314Z&amp;X-Amz-Expires=300&amp;X-Amz-Signature=0e2baa669b956b4ad1437f34635847771792d6b6e66ac4b1461ea5ffcd4ef72b&amp;X-Amz-SignedHeaders=host&amp;actor_id=5217734&amp;key_id=0&amp;repo_id=59527202&amp;response-content-disposition=attachment%3B%20filename%3DWorkFlowy.dmg&amp;response-content-type=application%2Foctet-stream</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/WorkFlowy.app</string>
				<key>requirement</key>
				<string>identifier "com.workflowy.desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = SYB6NBR48V</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/WorkFlowy.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
